# ETL
* How do we get data into a database?
* There are several different patterns, and at a high level you will hear this refered to as an ETL process: extract, transform, load
* This is often used in data warehousing specifically, and is usually done as a batch process

# ETL Steps
* The first step is extraction, where we pull data out of various databases. This could be csv, json files, or other SQL databases
* The second step is to transform it. Sometimes this is aligning data structures, mapping columns, or reducing the data.
* The third part is to load it, to push it into a new data warehouse (or database) as a solution
* Overall we call the ETL process a "pipeline" (or pipelines)

<img src="https://webassets.mongodb.com/_com_assets/cms/ETL_Visual-sa656kl6df.png" width=60%/>

# ETL Thoughts
* ETL is useful in reducing dependancies in the data created for warehouses and data marts
* ETL process can help with permissions issues and heterogeoneity of data sources, especially in an increasingly json world
* ETL tools are robust and processes are well known
* At the same time, the ETL process overall can be fragile depending upon the developer building it (all it takes is one failed statement to stop a pipeline)
* ETL is slow, and the batch-nature means that the data you are looking at is often not live

In [1]:
# Let's do some toy ETL in python
# first, let's load our datasets
import pandas as pd
df_person=pd.read_csv("person.csv")
df_sales=pd.read_csv("sales.csv")

In [2]:
# Let's assume we are building a datamart for the sales team, and we want to hide PII
# information to protect our customers in case of a data breach
df_person.head()

,first_name,last_name,street_address,city,postcode,id
0,Amanda,Miller,4302 John Skyway Apt. 650,West Victor,55311,4910
1,Monica,Jenkins,2794 Danielle Skyway Suite 323,West Jenniferport,91875,910
2,Keith,Richards,395 Lloyd Route Apt. 439,Port Ashleyville,1667,9970
3,Mark,Cowan,4026 Timothy Court,New Sarah,40411,8764
4,Amber,King,74417 Warren Ways Apt. 647,South Kelly,40440,6046

In [3]:
df_person=df_person[["street_address","city","postcode","id"]]
df_person.head()

                   street_address               city  postcode    id
0       4302 John Skyway Apt. 650        West Victor     55311  4910
1  2794 Danielle Skyway Suite 323  West Jenniferport     91875   910
2        395 Lloyd Route Apt. 439   Port Ashleyville      1667  9970
3              4026 Timothy Court          New Sarah     40411  8764
4      74417 Warren Ways Apt. 647        South Kelly     40440  6046

In [4]:
# Now let's check out sales
df_sales.head()

,credit_card_number,credit_card_provider,id,price,purchase_date,isbn10
0,2286937402408045,Discover,8360,7681,2020-03-02,0-7276-4998-1
1,30009424238819,JCB 15 digit,2416,1820,2020-04-13,0-617-66614-8
2,346863220162402,Diners Club / Carte Blanche,1206,2782,2020-09-02,1-4775-5373-8
3,4591096487982840,Mastercard,7494,844,2020-09-23,0-630-45908-8
4,4373723705109567,Maestro,8450,4740,2020-06-06,1-80546-961-4

In [5]:
# I wonder what that date is
df_sales.dtypes

credit_card_number       int64
credit_card_provider    object
id                       int64
price                    int64
purchase_date           object
isbn10                  object
dtype: object

In [6]:
# Let's fix that date column
df_sales["purchase_date"]=pd.to_datetime(df_sales["purchase_date"])
df_sales.head()

,credit_card_number,credit_card_provider,id,price,purchase_date,isbn10
0,2286937402408045,Discover,8360,7681,2020-03-02,0-7276-4998-1
1,30009424238819,JCB 15 digit,2416,1820,2020-04-13,0-617-66614-8
2,346863220162402,Diners Club / Carte Blanche,1206,2782,2020-09-02,1-4775-5373-8
3,4591096487982840,Mastercard,7494,844,2020-09-23,0-630-45908-8
4,4373723705109567,Maestro,8450,4740,2020-06-06,1-80546-961-4

In [7]:
df_sales.dtypes

credit_card_number               int64
credit_card_provider            object
id                               int64
price                            int64
purchase_date           datetime64[ns]
isbn10                          object
dtype: object

In [8]:
# Now, let's drop all of the people who aren't in the sales. The sales team
# doesn't need to know about them
print(f"Originally there were {len(df_person)} people")
df_person=df_person[df_person["id"].isin(df_sales["id"])]
print(f"In modified set there are {len(df_person)} people")

Originally there were 1000 people
In modified set there are 800 people

In [ ]:
# We can keep modifying the data as needed depending upon the business rules.
# For instance, let's say that credit card number is a sensitive but important
# piece of data. That is, we need to know whether the same credit card has been
# used, but we don't want to put the number in the database. How might we solve this?

In [20]:
def h(x):
    import hashlib
    return hashlib.md5(str(x).encode()).hexdigest()

df_sales["credit_card_number"]=df_sales["credit_card_number"].apply(h)
df_sales.head()

,credit_card_number,credit_card_provider,id,price,purchase_date,isbn10
0,60cb3ca758cacb123eff0dd516d4a6fa,Discover,8360,7681,2020-03-02,0-7276-4998-1
1,d5488a3f524f2e2de94d46c3f2a142c6,JCB 15 digit,2416,1820,2020-04-13,0-617-66614-8
2,6a3b447c02cef78f0dd73f181c09c521,Diners Club / Carte Blanche,1206,2782,2020-09-02,1-4775-5373-8
3,1f23209dda829a5c06d389473c619f5c,Mastercard,7494,844,2020-09-23,0-630-45908-8
4,44d7d4e82594312fac29a4cdf9bc5593,Maestro,8450,4740,2020-06-06,1-80546-961-4

* Let's assume that was all the transformation we wanted to do. Now we can push this data into the datamart.
* Most ETL libraries will automatically build the schema for you. This is cool!
* This is often done through object relational mapping (ORM) libraries
* In the python ecosystem this is handled usually by SQLAlchemy
* https://www.sqlalchemy.org/

In [21]:
import sqlalchemy
engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')

In [23]:
# once we have the engine created we can actually leverage pandas to push the dataframes directly
# into tables using the to_sql() functions
df_person.to_sql("person",engine,if_exists='replace')
df_sales.to_sql("sales",engine,if_exists='replace')

In [ ]:
# what went wrong?

In [ ]:
# now we can just check out result. For this in an interactive model I like to use the 
#%sql magics

In [24]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

'Connected: jovyan@si330'

In [25]:
%sql select * from person limit 5;

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (2, '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (3, '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046)]

In [26]:
%sql select * from sales limit 5;

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, '60cb3ca758cacb123eff0dd516d4a6fa', 'Discover', 8360, 7681, datetime.datetime(2020, 3, 2, 0, 0), '0-7276-4998-1'),
 (1, 'd5488a3f524f2e2de94d46c3f2a142c6', 'JCB 15 digit', 2416, 1820, datetime.datetime(2020, 4, 13, 0, 0), '0-617-66614-8'),
 (2, '6a3b447c02cef78f0dd73f181c09c521', 'Diners Club / Carte Blanche', 1206, 2782, datetime.datetime(2020, 9, 2, 0, 0), '1-4775-5373-8'),
 (3, '1f23209dda829a5c06d389473c619f5c', 'Mastercard', 7494, 844, datetime.datetime(2020, 9, 23, 0, 0), '0-630-45908-8'),
 (4, '44d7d4e82594312fac29a4cdf9bc5593', 'Maestro', 8450, 4740, datetime.datetime(2020, 6, 6, 0, 0), '1-80546-961-4')]

In [ ]:
# wait, is this what we want? what's wrong?

In [ ]:
%sql select * from sales limit 5;

* ok, that's the end of the ETL process. In our case it was pretty simple. In this week's assignment you have a bigger job to do
* a large scale business will have hundreds of these kinds of processes fire up nightly (or hourly), there's a lot that can go wrong
* an emerging technology to deal with these issues is called __data virtualization__ 
* I think data virtualization is frankly amazing and a game changer. In the data virtualization approach the data is left at it's source and the transformations are are "soft rules" which are done at run time
* Here is the sort of ETLhell that corporations can be locked into

<img src="https://community.denodo.com/tutorials/img/basics/zero_complete.png" />

* it can be a complete mess! The promise with data virtualization is that instead of these systems all speaking across one another with error prone ETL, you build a logial data layer which hides the implementation details
* everything in that logical layer looks like a new database, regardless of whether it's a csv, google sheet, api, json datastore, on prem or in the cloud
<img src="https://community.denodo.com/tutorials/img/basics/zero_denodo.png" />

* I'm going to try and arrange for a demonstration of a specific tool, Denodo, which we have here on campus.
* It's really really expensive, and reminds me of the "early days" of RDBMS systems with 6 digit price tags
* But it works really well, in my opinion, for some of my workloads
* (images ripped from https://community.denodo.com/tutorials/browse/basics/index)

# Views
* So we've ETLed the data up into our RDBMS for the sales team, but now we need to make views for them to make the data more coherent
* views allow us to create "virtual tables", where the underlying view the result of some query
* this allows to do further transformation and restriction of data if we want to
* it also allows us to bring the data together into something more managable for the person querying it

In [27]:
%sql select * from person limit 5;

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (2, '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (3, '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046)]

In [29]:
# the simple view syntax is CREATE VIEW name AS select_statement
%sql create view only_ports as select * from person where city like '%port%';

 * postgres://jovyan:***@localhost:5432/si330
Done.

[]

In [31]:
# this has allowed us to restrict which ROWS a user sees based on a given condition
%sql select * from only_ports; -- limit 5;

 * postgres://jovyan:***@localhost:5432/si330
43 rows affected.

[(1, '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (6, '7553 Watkins Curve Apt. 427', 'Brendaport', 16142, 7494),
 (8, '013 Tim Track Suite 187', 'North Patriciaport', 65340, 5842),
 (14, '864 Tamara Burgs Suite 603', 'Bishopport', 48723, 2180),
 (59, '98655 Jordan Prairie Suite 506', 'Sandraport', 89089, 9048),
 (68, '0142 Walter Loop Suite 655', 'Perezport', 98311, 412),
 (76, '9458 Ball Drives', 'Finleyport', 94498, 4594),
 (99, '1835 Cynthia Via Suite 392', 'Lake Timothyport', 70578, 3384),
 (103, '14080 Angela Islands', 'Garyport', 12927, 6583),
 (108, '809 Paul Overpass', 'Johnport', 2646, 5170),
 (129, '6283 Kristy Highway Suite 956', 'Cruzport', 12874, 6133),
 (147, '090 Nichols Valley Suite 019', 'Rayport', 50329, 5369),
 (204, '757 Anthony Track Apt. 384', 'Averyport', 33949, 3032),
 (219, '7734 Torres Mission', 'Zimmermanport', 72771, 2160),
 (257, '710 Justin Forest', 'North Coltonport', 23138, 6511),
 (300, '035 Baker Trail Apt. 602', 'North Troyport', 65490, 2726),
 (329, '469 Thompson Brook Suite 624', 'Daviesport', 98043, 8981),
 (374, '228 Myers Mountains Suite 721', 'Burnsport', 19840, 8260),
 (408, '9186 Aaron Cliff Apt. 948', 'North Jeffreyport', 87445, 121),
 (451, '44546 Christopher Corner', 'Brandonport', 7492, 2242),
 (478, '8489 Quinn Stream', 'South Davidport', 11453, 1094),
 (523, '50642 Fowler Crossing', 'Jasonport', 85762, 2761),
 (548, '95840 Lydia Run Apt. 272', 'New Toddport', 33298, 6114),
 (570, '1098 Daniel Plain', 'Jacksonport', 27748, 5107),
 (580, '9366 Huerta Walks', 'Larsenport', 8045, 9302),
 (598, '935 Williams River', 'Nicholasport', 31365, 5082),
 (599, '0939 Tanner Passage Apt. 256', 'Ericaport', 61080, 7440),
 (612, '417 Wanda Hollow', 'Debraport', 64295, 1269),
 (640, '082 Boyer Roads', 'Trevorport', 74889, 9292),
 (700, '2987 Sandra Plains Suite 764', 'Bradyport', 29808, 5707),
 (743, '465 Murphy Village Apt. 717', 'Andreaport', 1366, 3912),
 (766, '160 Coleman Fields Suite 444', 'North Brandiport', 16683, 2931),
 (778, '02996 James Neck Apt. 144', 'South Jessicaport', 47203, 8149),
 (781, '670 Gonzalez Coves', 'Gutierrezport', 68619, 1225),
 (823, '1996 Robin Fort Suite 689', 'Garyport', 18092, 5157),
 (837, '8359 Snow View Suite 885', 'New Joshuaport', 74922, 7019),
 (865, '3066 Lucas Green', 'Russellport', 4840, 2565),
 (869, '19519 Rachel Locks', 'Justinport', 4312, 8533),
 (887, '093 Jeffrey Turnpike', 'Moonport', 35048, 6845),
 (894, '58657 Sanders Light', 'Port Sharonport', 82690, 131),
 (942, '573 Thomas Dale Suite 285', 'Sabrinaport', 2425, 7903),
 (943, '3282 Michelle Roads', 'Brittanyport', 14815, 1311),
 (986, '2281 Lee Road', 'Ramosport', 78132, 4038)]

In [32]:
# we can restrict columns as well, maybe these users aren't allowed to see street_addresses
%sql drop view only_ports;
%sql create view only_ports as select city, postcode, id from person where city like '%port%';
%sql select * from only_ports limit 5;

 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('West Jenniferport', 91875, 910),
 ('Brendaport', 16142, 7494),
 ('North Patriciaport', 65340, 5842),
 ('Bishopport', 48723, 2180),
 ('Sandraport', 89089, 9048)]

In [33]:
%sql select count(*) as num, avg(price) as avg_price, min(purchase_date) as min_date from sales

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000, Decimal('5168.8820000000000000'), datetime.datetime(2020, 1, 1, 0, 0))]

In [34]:
# of course, we can set views to be the results of pretty much any SQL query, so they could be summary stats to
%sql create view summary_sales as select count(*) as num, avg(price) as avg_price, min(purchase_date) as min_date from sales
%sql select * from summary_sales

 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000, Decimal('5168.8820000000000000'), datetime.datetime(2020, 1, 1, 0, 0))]

In [36]:
%sql select * from sales limit 1;

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(0, '60cb3ca758cacb123eff0dd516d4a6fa', 'Discover', 8360, 7681, datetime.datetime(2020, 3, 2, 0, 0), '0-7276-4998-1')]

In [37]:
# what's really cool about views is that they are live views into the underlying tables.
# change a table and the view changes.
%sql insert into sales (price) values (9999);

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [44]:
%sql select * from summary_sales

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000, Decimal('5168.8820000000000000'), datetime.datetime(2020, 1, 1, 0, 0))]

In [42]:
%sql select credit_card_provider, count(*) from sales group by credit_card_provider;

 * postgres://jovyan:***@localhost:5432/si330
11 rows affected.

[('VISA 16 digit', 175),
 (None, 1),
 ('VISA 13 digit', 65),
 ('JCB 15 digit', 66),
 ('Discover', 100),
 ('Mastercard', 83),
 ('Maestro', 99),
 ('VISA 19 digit', 91),
 ('JCB 16 digit', 155),
 ('American Express', 85),
 ('Diners Club / Carte Blanche', 81)]

In [39]:
# My person particularities won't let me keep bad data in this database
%sql select * from sales where credit_card_number is null

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(None, None, None, None, 9999, None, None)]

In [43]:
%sql delete from sales where credit_card_number is null

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [45]:
# views are also updatable, sometimes. This is interesting, and sometimes infuriating
%sql select * from only_ports limit 5;

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('West Jenniferport', 91875, 910),
 ('Brendaport', 16142, 7494),
 ('North Patriciaport', 65340, 5842),
 ('Bishopport', 48723, 2180),
 ('Sandraport', 89089, 9048)]

In [46]:
%sql select count(*) from only_ports

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(43,)]

In [47]:
%sql insert into only_ports (city, postcode, id) values ('Chrisport','90210',22);

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [48]:
%sql select count(*) from only_ports

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(44,)]

In [49]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hills','90210',22);

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [50]:
# did it put it in our view?
%sql select count(*) from only_ports

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(44,)]

In [51]:
# whew, that's good, it's not a port
# but wait, what about our underlying table?
%sql select * from person where city ='Beverly Hills'

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(None, None, 'Beverly Hills', 90210, 22)]

In [52]:
# we can dabble in some advanced parameters after checking the docs to control this behavior
%sql drop view if exists only_ports
%sql create view only_ports as select * from person where city like '%port%' with check option;

 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
Done.

[]

In [53]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hills','90210',22);

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.WithCheckOptionViolation) new row violates check option for view "only_ports"
DETAIL:  Failing row contains (null, null, Beverly Hills, 90210, 22).

[SQL: insert into only_ports (city, postcode, id) values ('Beverly Hills','90210',22);]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [54]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hillsport','90210',22);

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [ ]:
# ok, whew, that was a lot, let's get rid of our tables now and clean up
%sql drop table person;
%sql drop tables sales;

In [ ]:

select *
from (select *
      from coursera.assessment_actions
      where assessment_id in (select assessment_id
                              from coursera.course_branch_item_assessments
                              where course_item_id = 'AhLUP')) as actions
         left join (
    select *
    from (select assessment_response_score,
                 assessment_id,
                 assessment_question_id,
                 assessment_response_id,
                 assessment_action_id
          from coursera.assessment_responses
          where assessment_id in (select assessment_id
                                  from coursera.course_branch_item_assessments
                                  where course_item_id = 'AhLUP')) as grades
             left join coursera.assessment_response_options as details
                       on grades.assessment_response_id = details.assessment_response_id
) as subsmissions on actions.assessment_action_id = subsmissions.assessment_action_id;

In [56]:
with open("untitled.txt","r") as file:
    content=file.read()
    %sql $content

 * postgres://jovyan:***@localhost:5432/si330
Done.

In [57]:
%sql select * from dog

 * postgres://jovyan:***@localhost:5432/si330
0 rows affected.

[]

In [60]:
!pq

/bin/sh: 1: pq: not found